tap "cloudflare/cloudflare"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "asdf"
brew "cloudflared"
brew "docker"
brew "docker-compose"
brew "docker-machine"
brew "fish"
brew "gettext"
brew "gh"
brew "git-quick-stats"
brew "gum"
brew "icu4c"
brew "jq"
brew "libx11"
brew "mas"
brew "podman-compose"
brew "python@3.10"
brew "rcm"
brew "redis", restart_service: true
brew "socket_vmnet"
brew "spoof-mac"
brew "starship"
brew "tailscale"
brew "thefuck"
brew "wakeonlan"
cask "audacity"
cask "azure-data-studio"
cask "calibre"
cask "cheatsheet"
cask "cloudflare-warp"
cask "divvy"
cask "firefox"
cask "fmail2"
cask "font-caskaydia-cove-nerd-font"
cask "hammerspoon"
cask "joplin"
cask "karabiner-elements"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-remote-desktop"
cask "monitorcontrol"
cask "mono-mdk-for-visual-studio"
cask "nightfall"
cask "onedrive"
cask "podman-desktop"
cask "powershell"
cask "stats"
cask "visual-studio"
cask "visual-studio-code"
cask "xamarin-mac"
mas "Divvy", id: 413857545
mas "Hand Mirror", id: 1502839586
mas "Instapaper", id: 288545208
mas "Instapaper Save", id: 1481302432
mas "Kindle", id: 405399194
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "OneDrive", id: 823766827
mas "Slack", id: 803453959
mas "Tailscale", id: 1475387142
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "austincummings.razor-plus"
vscode "bmalehorn.vscode-fish"
vscode "bungcip.better-toml"
vscode "Clancey.comet-debug"
vscode "derivitec-ltd.vscode-dotnet-adapter"
vscode "docsmsft.docs-yaml"
vscode "eamodio.gitlens"
vscode "formulahendry.dotnet"
vscode "formulahendry.dotnet-test-explorer"
vscode "ginfuru.ginfuru-better-solarized-dark-theme"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.remotehub"
vscode "GitHub.vscode-pull-request-github"
vscode "hbenl.vscode-test-explorer"
vscode "Mebrahtom.plantumlpreviewer"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.blazorwasm-companion"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.mono-debug"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "ryanolsonx.solarized"
vscode "SimonSiefke.svg-preview"
vscode "skyapps.fish-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "sumneko.lua"
vscode "vadimcn.vscode-lldb"
vscode "virgilsisoe.hammerspoon"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "yinfei.luahelper"
